In [1]:
import requests

URL_BANCOS = "https://brasilapi.com.br/api/banks/v1/"

resposta_bancos = requests.get(URL_BANCOS)

resposta_bancos.status_code

200

In [3]:
bancos = resposta_bancos.json()

import pandas as pd

df = pd.DataFrame(bancos)

df.head()

,ispb,name,code,fullName
0,00000000,BCO DO BRASIL S.A.,1.0,Banco do Brasil S.A.
1,00000208,BRB - BCO DE BRASILIA S.A.,70.0,BRB - BANCO DE BRASILIA S.A.
2,00038121,Selic,NaN,Banco Central do Brasil - Selic
3,00038166,Bacen,NaN,Banco Central do Brasil
4,00122327,SANTINVEST S.A. - CFI,539.0,"SANTINVEST S.A. - CREDITO, FINANCIAMENTO E INV..."

In [5]:
df.iloc[-2:]['ispb']

357
358
Name: ispb, dtype: object

In [6]:
df = df.iloc[:-2]

df.tail()

,ispb,name,code,fullName
352,92856905,ADVANCED CC LTDA,117.0,ADVANCED CORRETORA DE CÂMBIO LTDA
353,92874270,BCO DIGIMAIS S.A.,654.0,BANCO DIGIMAIS S.A.
354,92875780,WARREN CVMC LTDA,371.0,WARREN CORRETORA DE VALORES MOBILIÁRIOS E CÂMB...
355,92894922,BANCO ORIGINAL,212.0,Banco Original S.A.
356,94968518,EFX CC LTDA.,289.0,EFX CORRETORA DE CÂMBIO LTDA.

In [7]:
df[df['code'].isnull()]

,ispb,name,code,fullName
2,00038121,Selic,NaN,Banco Central do Brasil - Selic
3,00038166,Bacen,NaN,Banco Central do Brasil
10,00394460,STN,NaN,Secretaria do Tesouro Nacional - STN
40,02992335,CIP SA Siloc,NaN,CIP S.A
58,04391007,CAMARA INTERBANCARIA DE PAGAMENTOS - CIP,NaN,CIP S.A
184,28719664,Balcão B3,NaN,Sistema do Balcão B3
185,29011780,CIP SA C3,NaN,CIP S.A
285,54641030,Câmara B3,NaN,Câmara B3
304,60934221,Câmbio B3,NaN,Câmara de Câmbio B3

In [8]:
df = df.dropna(subset=['code'])

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 348 entries, 0 to 356
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ispb      348 non-null    object
 1   name      348 non-null    object
 2   code      348 non-null    float64
 3   fullName  348 non-null    object
dtypes: float64(1), object(3)
memory usage: 13.6+ KB

In [9]:
df.head()

,ispb,name,code,fullName
0,00000000,BCO DO BRASIL S.A.,1.0,Banco do Brasil S.A.
1,00000208,BRB - BCO DE BRASILIA S.A.,70.0,BRB - BANCO DE BRASILIA S.A.
4,00122327,SANTINVEST S.A. - CFI,539.0,"SANTINVEST S.A. - CREDITO, FINANCIAMENTO E INV..."
5,00204963,CCR SEARA,430.0,COOPERATIVA DE CREDITO RURAL SEARA - CREDISEARA
6,00250699,AGK CC S.A.,272.0,AGK CORRETORA DE CAMBIO S.A.

In [10]:
df['code'] = df['code'].astype(int)

df.head()

,ispb,name,code,fullName
0,00000000,BCO DO BRASIL S.A.,1,Banco do Brasil S.A.
1,00000208,BRB - BCO DE BRASILIA S.A.,70,BRB - BANCO DE BRASILIA S.A.
4,00122327,SANTINVEST S.A. - CFI,539,"SANTINVEST S.A. - CREDITO, FINANCIAMENTO E INV..."
5,00204963,CCR SEARA,430,COOPERATIVA DE CREDITO RURAL SEARA - CREDISEARA
6,00250699,AGK CC S.A.,272,AGK CORRETORA DE CAMBIO S.A.

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 348 entries, 0 to 356
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ispb      348 non-null    object
 1   name      348 non-null    object
 2   code      348 non-null    int32
 3   fullName  348 non-null    object
dtypes: int32(1), object(3)
memory usage: 12.2+ KB

In [12]:
df.to_csv("bancos.csv", index=False)

In [14]:
URL_BANCO_ITAU = "https://brasilapi.com.br/api/banks/v1/341"

resposta_itau = requests.get(URL_BANCO_ITAU)

resposta_itau.status_code

200

In [15]:
resposta_itau.json()

{'ispb': '60701190',
 'name': 'ITAÚ UNIBANCO S.A.',
 'code': 341,
 'fullName': 'ITAÚ UNIBANCO S.A.'}

In [18]:
URL_DDD = "https://brasilapi.com.br/api/ddd/v1/"

resposta_ddd_21 = requests.get(URL_DDD + "21")

resposta_ddd_21.status_code

200

In [19]:
resposta_ddd_21.headers

{'Date': 'Wed, 15 Jan 2025 11:06:18 GMT', 'Content-Type': 'application/json; charset=utf-8', 'Transfer-Encoding': 'chunked', 'Connection': 'keep-alive', 'access-control-allow-origin': '*', 'Age': '85901', 'Cache-Control': 'max-age=0, public', 'etag': 'W/"154-5oW5jD86feVFDMSU00rUYreLC9g"', 'strict-transport-security': 'max-age=63072000', 'x-matched-path': '/api/ddd/v1/[ddd]', 'x-vercel-cache': 'HIT', 'x-vercel-id': 'gru1::sfo1::ckhb8-1736939178114-c655009067e5', 'cf-cache-status': 'DYNAMIC', 'Report-To': '{"endpoints":[{"url":"https:\\/\\/a.nel.cloudflare.com\\/report\\/v4?s=cjv3jHVK5kzUtKn7AsPi9qL1H4geT4bn%2BqFqCkGuHPbrRPDMjyaE%2FLJiVibUIGO7SB0aMsYAjPfOaDfeXl6v6giBBiSogVKoSeHqGyCq4GTyD%2B61BmmpsvD%2FF8HSuQdEBi1j"}],"group":"cf-nel","max_age":604800}', 'NEL': '{"success_fraction":0,"report_to":"cf-nel","max_age":604800}', 'Server': 'cloudflare', 'CF-RAY': '902565471d0f3fc4-GYN', 'Content-Encoding': 'gzip', 'alt-svc': 'h3=":443"; ma=86400', 'server-timing': 'cfL4;desc="?proto=TCP&rtt=15827&min_rtt=14574&rtt_var=6361&sent=4&recv=6&lost=0&retrans=0&sent_bytes=2854&recv_bytes=779&delivery_rate=200356&cwnd=251&unsent_bytes=0&cid=850928669dd24a6d&ts=161&x=0"'}

In [20]:
resposta_ddd_21.json()

{'state': 'RJ',
 'cities': ['TERESÓPOLIS',
  'TANGUÁ',
  'SEROPÉDICA',
  'SÃO JOÃO DE MERITI',
  'SÃO GONÇALO',
  'RIO DE JANEIRO',
  'RIO BONITO',
  'QUEIMADOS',
  'PARACAMBI',
  'NOVA IGUAÇU',
  'NITERÓI',
  'NILÓPOLIS',
  'MESQUITA',
  'MARICÁ',
  'MANGARATIBA',
  'MAGÉ',
  'JAPERI',
  'ITAGUAÍ',
  'ITABORAÍ',
  'GUAPIMIRIM',
  'DUQUE DE CAXIAS',
  'CACHOEIRAS DE MACACU',
  'BELFORD ROXO']}

In [22]:
df = pd.DataFrame(resposta_ddd_21.json()).assign(ddd=21)

df

   state                cities  ddd
0     RJ           TERESÓPOLIS   21
1     RJ                TANGUÁ   21
2     RJ            SEROPÉDICA   21
3     RJ    SÃO JOÃO DE MERITI   21
4     RJ           SÃO GONÇALO   21
5     RJ        RIO DE JANEIRO   21
6     RJ            RIO BONITO   21
7     RJ             QUEIMADOS   21
8     RJ             PARACAMBI   21
9     RJ           NOVA IGUAÇU   21
10    RJ               NITERÓI   21
11    RJ             NILÓPOLIS   21
12    RJ              MESQUITA   21
13    RJ                MARICÁ   21
14    RJ           MANGARATIBA   21
15    RJ                  MAGÉ   21
16    RJ                JAPERI   21
17    RJ               ITAGUAÍ   21
18    RJ              ITABORAÍ   21
19    RJ            GUAPIMIRIM   21
20    RJ       DUQUE DE CAXIAS   21
21    RJ  CACHOEIRAS DE MACACU   21
22    RJ          BELFORD ROXO   21

In [24]:
for ddd in range(20, 31):
    resposta = requests.get("".join([URL_DDD, str(ddd)]))
    print(f"DDD: {ddd} - status code: {resposta.status_code}")

DDD: 20 - status code: 404
DDD: 21 - status code: 200
DDD: 22 - status code: 200
DDD: 23 - status code: 404
DDD: 24 - status code: 200
DDD: 25 - status code: 404
DDD: 26 - status code: 404
DDD: 27 - status code: 200
DDD: 28 - status code: 200
DDD: 29 - status code: 404
DDD: 30 - status code: 404

In [25]:
df = pd.DataFrame()

for ddd in range(20, 31):
    resposta = requests.get("".join([URL_DDD, str(ddd)]))
    if resposta.status_code == 200:
        df = pd.concat([df, pd.DataFrame(resposta.json()).assign(ddd=ddd)])

df.head()

  state              cities  ddd
0    RJ         TERESÓPOLIS   21
1    RJ              TANGUÁ   21
2    RJ          SEROPÉDICA   21
3    RJ  SÃO JOÃO DE MERITI   21
4    RJ         SÃO GONÇALO   21

In [26]:
df.tail()

   state              cities  ddd
23    ES  BOM JESUS DO NORTE   28
24    ES     ATILIO VIVACQUA   28
25    ES              APIACÁ   28
26    ES            ANCHIETA   28
27    ES              ALEGRE   28

In [27]:
df = df.reset_index(drop=True)

df

    state              cities  ddd
0      RJ         TERESÓPOLIS   21
1      RJ              TANGUÁ   21
2      RJ          SEROPÉDICA   21
3      RJ  SÃO JOÃO DE MERITI   21
4      RJ         SÃO GONÇALO   21
..    ...                 ...  ...
165    ES  BOM JESUS DO NORTE   28
166    ES     ATILIO VIVACQUA   28
167    ES              APIACÁ   28
168    ES            ANCHIETA   28
169    ES              ALEGRE   28

[170 rows x 3 columns]

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 170 entries, 0 to 169
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   170 non-null    object
 1   cities  170 non-null    object
 2   ddd     170 non-null    int64
dtypes: int64(1), object(2)
memory usage: 4.1+ KB

In [29]:
URL_MUNICIPIOS_RJ = "https://brasilapi.com.br/api/ibge/municipios/v1/RJ?providers=dados-abertos-br,gov,wikipedia"

resposta_municipios_rj = requests.get(URL_MUNICIPIOS_RJ)

resposta_municipios_rj.status_code

200

In [30]:
resposta_municipios_rj.json()[:5]

[{'nome': 'ANGRA DOS REIS', 'codigo_ibge': '3300100'},
 {'nome': 'APERIBÉ', 'codigo_ibge': '3300159'},
 {'nome': 'ARARUAMA', 'codigo_ibge': '3300209'},
 {'nome': 'AREAL', 'codigo_ibge': '3300225'},
 {'nome': 'ARMAÇÃO DOS BÚZIOS', 'codigo_ibge': '3300233'}]

In [31]:
df = pd.DataFrame(resposta_municipios_rj.json())

df

                  nome codigo_ibge
0       ANGRA DOS REIS     3300100
1              APERIBÉ     3300159
2             ARARUAMA     3300209
3                AREAL     3300225
4   ARMAÇÃO DOS BÚZIOS     3300233
..                 ...         ...
87           TRÊS RIOS     3306008
88             VALENÇA     3306107
89           VARRE-SAI     3306156
90           VASSOURAS     3306206
91       VOLTA REDONDA     3306305

[92 rows x 2 columns]

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92 entries, 0 to 91
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   nome         92 non-null     object
 1   codigo_ibge  92 non-null     object
dtypes: object(2)
memory usage: 1.6+ KB